{"id": "t3_1p1nwoh", "url": "https://reddit.com/r/phishing/comments/1p1nwoh/new_moderator/", "victim_title": "New moderator", "victim_body": "Hi community, I'm u/YourUsernameForever and you may know me from moderating r/Scams \\- I'm the new moderator here.\n\nLike many people here I noticed that r/phishing was severely unmoderated, so I tried contacting the previous moderators to offer a helping hand. Having no response, filed a r/redditrequest and the admins assigned me as top mod.\n\nMy intention is to keep the community running as usual, not trying to make it another Scams subreddit. I believe our goal here is specific enough that it's worth keeping and growing.\n\nEver since I took the role I have:\n\n1. **Added community rules:** most of them based on the [Reddit Content Policy](https://redditinc.com/policies/reddit-rules) which is mandatory for every subreddit, but it's good to clarify and expand a little. This will also allow for removals with a proper explanation and a chance to appeal. You can read the subreddit rules in the sidebar if you're on a computer, or clicking here if you're on any device - [https://www.reddit.com/r/phishing/wiki/rules/](https://www.reddit.com/r/phishing/wiki/rules/)\n2. **Created a posting guideline:** to be strictly enforced in 2026, basically all posts must have a descriptive title and a transcription of what's in a screenshot. There's more to it if you want to read it fully - [https://www.reddit.com/r/phishing/wiki/posting-guideline/](https://www.reddit.com/r/phishing/wiki/posting-guideline/)\n3. **Implemented AutoModerator:** based on the rules and the guideline, AutoModerator will catch offending posts and comments, place them in a moderation queue, which I will manually review every day. I also reply to modmails daily. The idea is to have a responsive moderation team, to be held accountable and have a chance to appeal decisions. We also have !commands now, which I hope you help me expand to specific phishing scenarios.\n4. **Implemented posting guidance:** small alerts while you post that will let you know if something may be wrong, like posting an email address.\n5. **Added a few bots:** and I'll ask u/erishun to implement u/ScamsBot as well, so we can call !whois\n\nA big change moving forward will be this whole thing about requiring transcriptions of screenshots. A lot of kicking and screaming will ensue, but I promise you, it fends off bots, helps the search engine and helps integrate users that are visually impaired.\n\n**If you got this far into my post, this message is for you.** I need you to take a look at the rules and tell me what you think. I also want you to report anything that breaks the rules, knowing that I manually review all the reports daily: 100% of reports get reviewed manually. I'm also open to any type of feedback, privately if you want, but [use modmail instead of sending me a DM](https://www.reddit.com/message/compose?to=r/phishing).\n\nI hope my participation gives you extra energy to stay and grow the community together. Remember: I'm at your service! I'm also cronichally online so I hope this helps.\n\n\n\nYours, verbose as usual,\n\n\\- u/YourUsernameForever", "ocr_text": "", "has_image": false}
{"id": "t3_1rfswqd", "url": "https://reddit.com/r/phishing/comments/1rfswqd/eggywallcc_dns_hosting_40_roblox_impersonation/", "victim_title": "eggywall.cc DNS hosting 40+ roblox impersonation domains – registrar abuse email blocking reports", "victim_body": "Hi,\n\nI’ve been investigating a coordinated phishing infrastructure targeting Roblox users.\n\nWhat I’ve documented so far:\n\n• 40+ domains impersonating roblox across ccTLDs (roblox.cd, roblox.mq, roblox.com.ge, roblox.com.bo, etc.)  \n• Shared nameservers: ns1.eggywall.cc / ns2.eggywall.cc  \n• Central infrastructure domain: eggywall.cc  \n• Several domains resolve to the same backend IP patterns  \n• Reported multiple domains to their respective registries  \n• Reported to Roblox phishing team  \n• Attempted to report to the registrar (NiceNIC), but abuse@nicenic.net blocks my messages\n\nThe operators appear to be masking hosting behind immortalnode.com (dedicated-service page), likely as a reseller/front.\n\nQuestions for those experienced with infrastructure-level abuse:\n\n1. When a registrar filters or blocks abuse emails, what’s the proper escalation path?\n2. Best way to identify the true upstream provider behind a reseller setup?\n3. Would you escalate via ICANN compliance first, or target upstream ASN/hosting provider?\n\nI’m not asking whether it’s phishing — I’m trying to figure out the most effective takedown path at the infrastructure level.\n\nAny technical advice appreciated.", "ocr_text": "", "has_image": false}
{"id": "t3_1rfbf2k", "url": "https://reddit.com/r/phishing/comments/1rfbf2k/microsoft_azure_phishing_attempt/", "victim_title": "Microsoft Azure Phishing Attempt", "victim_body": "https://preview.redd.it/bj60cmdjlulg1.jpg?width=1668&amp;format=pjpg&amp;auto=webp&amp;s=3118e85db3fd10da471e0871e928ba23a6510533\n\nhttps://preview.redd.it/q1b6lfbklulg1.jpg?width=1668&amp;format=pjpg&amp;auto=webp&amp;s=294a5e81dfaab1564be6515a03994f28df0d48e5\n\nI don't even have an Azure account or subscription with the email that this was sent to. For my actual Azure account, the subscription ID doesn't match any of my subscriptions and I doubt that number belongs to Microsoft.", "ocr_text": "", "has_image": false}
{"id": "t3_1rfuypi", "url": "https://reddit.com/r/phishing/comments/1rfuypi/i_clicked_on_a_phishing_email_what_precautions/", "victim_title": "I clicked on a phishing email. What precautions should I take?", "victim_body": "A friend got hacked and I received the following email. I clicked the “view invitation” button and it took me to a landing page that was prompting me to login with email. I stopped there and checked in with her. Turns out she’d been hacked.\n\nI changed my Gmail password, should I do it monitor anything else?", "ocr_text": "< Ts =\nSPECIAL INVITE FROM 2\n\npe\nE |\n‘ Ww\n\nInbox\n\n=a ~ \"ra 12:52PM © «4\nto bcc: me v\n\nQvite\n\nYou're Invited\n\nSpecial Celebration\n\nDownload the Evite Mobile App\n\nGETITON £, Download on the\n» Google Play || @& App Store\n\n4 Reply - Forward (@)", "has_image": true}
{"id": "t3_1rfn2u2", "url": "https://reddit.com/r/phishing/comments/1rfn2u2/possible_scam_or_legit_verification_text_from/", "victim_title": "Possible scam or legit verification? Text from “Elan” about Old National Bank credit card", "victim_body": "For context: I did apply for a credit card on 02/09/26.\n\nI received two identical texts from short code 75452 claiming to be from “Elan” about a New Old National Bank credit card application. The message said:\n\n“FreeMsg: Elan App#\\[redacted\\]. New Old National Bank credit card app rcvd 02/09/26. Did you apply? Reply 1=YES 2=NO or HELP. STOP to opt out.”\n\nSince I actually applied, I replied YES.\n\nI then received this follow-up:\n\n“FreeMsg: Elan Thanks, more information is needed to process your application. Please call \\[redacted\\] Mon-Fri, 7am-9pm CT or Reply 1 to be called ASAP.”\n\nThe texts look automated and include a specific application number (which I redacted).\n\nHas anyone seen this before? Is this legitimate verification from Old National Bank / Elan Financial Services, or is this a phishing attempt trying to get me to call that number?", "ocr_text": "2:01 ot bd 45 |\n\n<@ @\n@>\n75452\n\nCc\n\next Message - SMS\n\nFri, Feb 13 at 11:16 AM\n\nFreeMsg: Elan\n\nApp New Old\nNational Bank credit card app\n\nrcvd 02/09/26. Did you apply?\nReply 1=YES 2=NO or HELP.\nSTOP to opt out.\n\nFreeMsg: Elan\n\nApp? lll), New Old\nNational Bank credit card app\nrcvd 02/09/26. Did you apply?\nReply 1=YES 2=NO or HELP.\nSTOP to opt out.\n\nFri, Feb 13 at 1:33 PM\n\nFreeMsg: Elan Thanks, more\ninformation is needed to\nprocess your application.\nPlease call +18552286631\nMon-Fri, Zam-9pm CT or Reply\n1 to be called ASAP.\n\nIf you did not expect this message from an unknown sender, it may\nbe spam.\n\nCtaniar Darnart Cram\n\n-+", "has_image": true}
{"id": "t3_1rf0f0o", "url": "https://reddit.com/r/phishing/comments/1rf0f0o/easy_scam_via_email_i_almost_fell_for_by_reading/", "victim_title": "Easy Scam via email I almost fell for by reading too fast.", "victim_body": "I was out with hubs for our date night and I got this email. It was sent from my store to me. I should have noticed that 🤦🏽‍♀️ I saw that someone had placed an order but wondered why it was less than the listing price. Another lightbulb. I clicked the link and signed in. (I know, I know.)\n\nThen I noticed that the chat box popped open and was guiding me on steps to take because “Etsy’s payment systems have changed and the payments will be sent to your card on file. “\n\nThis is where I stepped on the brakes because the address was just off to me. Then another message came in that read “A passcode will be sent to your phone number by text. Enter the code that’s issued by your card issuer. Enter it here.  If the passcode has not been issued, just let us know.”\n\nI copy the link and gave it to ChatGPT.  Came back as indeed a scam. \n\nThese no good scoundrels almost had me. \n\nChanged my Etsy password and cursed under my breath. Good thing I caught it because there are times I read faster than I should. ", "ocr_text": "< nN Vv\n\npe This message is from a x\n© mailing list.\n\nUnsubscribe\nFrom:\n\nTo:\nToday at 9:22PM\n\n#BVUHSUHC\n\nEtsy\n\n‘+ New order placed\n\n“eS... Sateettletitent A buyer\n\njust purchased:\n\nft o« Gi", "has_image": true}
{"id": "t3_1rf0bwf", "url": "https://reddit.com/r/phishing/comments/1rf0bwf/does_anyone_know_anything_about_the_domain/", "victim_title": "Does anyone know anything about the domain gmaail.com", "victim_body": "I received an online job offer of 700 Euros a month from a business called centro cosmetika using this email address @gmaail.com", "ocr_text": "", "has_image": false}
{"id": "t3_1rei182", "url": "https://reddit.com/r/phishing/comments/1rei182/scam_email_about_watching_porn/", "victim_title": "Scam email about watching porn", "victim_body": "I was looking thru my spam email today and i got sum random email saying theyve been watching me for some time and that they have videos of me masturbating and blah blah blah and im sure its a scam but the only concern i have is that they mentioned the job i work at which is weird.. i dont really check my spam and I just so happened to today and im kinda anxious idk😓", "ocr_text": "", "has_image": false}
{"id": "t3_1reicmm", "url": "https://reddit.com/r/phishing/comments/1reicmm/my_old_mails_keep_getting_replaced_and_a_bunch_of/", "victim_title": "My old mails keep getting replaced, and a bunch of draft appeared", "victim_body": "As far as i know. I havent clicked on anything dangerous, just the usual and Overwolf for minecraft mods, i replaced my password and enabled 2FA but its to no avail\n\nThey have my mail and old password, which is the blurried part\n\nMy mails keep getting replaced, old and new, i dont know what to do and need help, what can i do. Am i safe? Can i save this email?\n\nEDIT: They changed the language to Vietnamese", "ocr_text": "", "has_image": false}
{"id": "t3_1re9t2t", "url": "https://reddit.com/r/phishing/comments/1re9t2t/i_keep_getting_emails_from_jobs_i_never_applied_to/", "victim_title": "I keep getting emails from jobs I never applied to.", "victim_body": "I’m not sure why, but once every 30 seconds I get an email from this MyCareerFriend account telling me to complete an application I never started. They all are offering ludicrous amounts of money. One email even told me that my loan (that I never applied for) was approved??", "ocr_text": "Work Notifications 5:25AM\nINTERVIEW -- Reply Requested\nDear ’ -:,: u're being requested to r... vy\n\nInterview Pending 5:24AM\nTESLA INTERVIEW for.  ~—- - Third...\nThis is my third attempt to contact you.T... y7\n\nInterview Pending 5:23 AM\nCOCA-COLA INTERVIEW for re\nThis is my 3rd attempt to contact you. C... kg\n\nInterview Pending 5:22 AM\nFRITO LAY INTERVIEW fo.- - ~ ‘Th...\nThis is my third attempt to contact you.... kg\n\nInterview Pending 5:21AM\nGOODWILL INTERVIEW for ~ eich.\nThis is my 3rd attempt to reach out to y... kg\n\nThank You! 5:20AM\n\n~ - HILTO...\nI've b\nCen uyury vO feacn OUT TO YOU. HIL..\n\nEmployment Service Pros 3 5:19 AM\nHello Again, - “Your Resume Is...\nHello again, Crystal. Your qualifications I... kg\n\nInterview Pending 5:18 AM\nMCKESSON INTERVIEW fer . ae ee\nThis is my third attempt to contact you.... > i ¢\n\nNew Career\nAmazon: Verification Request\nHi * ‘ You're being requested to vie... Ww", "has_image": true}
{"id": "t3_1rdmmwq", "url": "https://reddit.com/r/phishing/comments/1rdmmwq/got_this_text_from_apple_is_there_more_i_can_do/", "victim_title": "Got this text from “Apple”, is there more I can do besides report it as junk and block?", "victim_body": "As the title says, I received this text and reported it as junk. It appears my phone number has been on a list for years now. I know my ex from 9 years ago used it when he didn’t have a phone so some of the texts are addressed to him. I have to keep the “unknown callers silenced” option on 24/7 or else I’m bombarded with all types of calls, texts and once received an email threat with photos of a house I lived at a long time ago. What can I do? Is my only hope to change my phone number and email accounts? Apple ID too? It’s creepy and I want it to stop. \n\nThanks for any advice!", "ocr_text": "+63 908 198 8194 >\n\niMessage\nToday 12:08PM\n\nYour Apple ID Your Apple ID was\nrecently used at CHILD\nPORNOGRAPHY WEBSITE for\n$572.62 Via Apple Pay Pre-\nAuthorization We have placed\nthose requests on hold to\nensure safest and Security. Not\nyou? Immediately call Apple\nSupport +1-812-266-5960 to\nFreeze it!\n\nIf this activity is familiar, no\naction is required, and the\ntransaction will proceed within\n24 hours. If not, contact Apple\nSupport immediately at\n+1-812-266-5960 for\nassistance.\n\nNeed Assistance?\n\nApple Support:\n+1-812-266-5960\n\nBilling Help: https://iios-apple-\ninvoice.vercel.app/\n\nar iMessage", "has_image": true}
{"id": "t3_1rdvq2p", "url": "https://reddit.com/r/phishing/comments/1rdvq2p/phishing_from_microsoftcom_domain/", "victim_title": "Phishing from microsoft.com Domain", "victim_body": "Looks like  someone figured out how to use Farbic to send phishing emails that actually originate from microsoft.com. Did anyone else receive this ?\n\nThe header shows it's actually from [Microsoft.com](http://Microsoft.com)\n\nAuthentication-Results: spf=pass (sender IP is 20.83.222.105)  \n[smtp.mailfrom=microsoft.com](http://smtp.mailfrom=microsoft.com); dkim=pass (signature was verified)  \n[header.d=microsoft.com](http://header.d=microsoft.com);dmarc=pass action=none  \n[header.from=microsoft.com](http://header.from=microsoft.com);compauth=pass reason=100\n\nhttps://preview.redd.it/urm3f6e3wilg1.png?width=891&amp;format=png&amp;auto=webp&amp;s=a7e0544d3a163d17c35122d7fe196556184ea3c6", "ocr_text": "", "has_image": false}
{"id": "t3_1rchud9", "url": "https://reddit.com/r/phishing/comments/1rchud9/outlook_has_a_phishing_email_linked_in_contacts/", "victim_title": "Outlook has a phishing email linked in contacts", "victim_body": "Need advice please regarding my email account\n\nI was on outlook and noticed that 2 of my contacts had a phishing email. Checked both my sent, junk and trash folder to see any history of the email but nothing. Only appears in contacts\n\nNeed advice. Has my email been spoofed, have I been hacked. Please help ", "ocr_text": "", "has_image": false}
{"id": "t3_1rcqj8q", "url": "https://reddit.com/r/phishing/comments/1rcqj8q/very_strange_text_message/", "victim_title": "Very Strange Text Message", "victim_body": "Hello! I have been receiving a lot of text messages of someone trying to access various accounts on my phone number. I also got a call who, when I answered, immediately hang up. But what stumbled me was a very weird message on WhatsApp from a contact called scxn: Timestamp checker has recognized a time synchronization inconsistency, XXXX. Verify to continue.\n\nAnyone got an idea what this could be?\n\nEDIT: The XXXX were numbers", "ocr_text": "", "has_image": false}
{"id": "t3_1rcdwdw", "url": "https://reddit.com/r/phishing/comments/1rcdwdw/fell_for_winna_scam_phishing_i_feel_so_stupid/", "victim_title": "Fell for Winna scam phishing. I feel so stupid.", "victim_body": "I was searching on duckduckgo and for winna and clicked on what i thought was the official site. I ended up going to a fake site, logged in, and typed my 2fa. Ended up not working and now I'm locked out of my account. I'm sure they made off with my money. \n\nI did some more research and seems like, for duckduckgo, they seem to rank fake sites a lot for smaller brands. not like Google or Bing. Might be good to be aware of if you don't want to get pfished.", "ocr_text": "", "has_image": false}
{"id": "t3_1rce1y9", "url": "https://reddit.com/r/phishing/comments/1rce1y9/starkiller_new_phishing_framework_proxies_real/", "victim_title": "Starkiller: New Phishing Framework Proxies Real Login Pages to Bypass MFA", "victim_body": "Once Starkiller customers select the URL to be phished, the service spins up a Docker container running a headless Chrome browser instance that loads the real login page.\n\n“The container then acts as a man-in-the-middle reverse proxy, forwarding the end user’s inputs to the legitimate site and returning the site’s responses\"\n\n\"Every keystroke, form submission, and session token passes through attacker-controlled infrastructure and is logged along the way.”\n\n\"The platform also includes keylogger capture for every keystroke, cookie and session token theft for direct account takeover, geo-tracking of targets, and automated Telegram alerts when new credentials come in”\n\n“The attacker captures the resulting session cookies and tokens, giving them authenticated access to the account\"\n\nThis service strikes me as a remarkable evolution in phishing, and its apparent success is likely to be copied by other.\n\nRead more:\n\nhttps://krebsonsecurity.com/2026/02/starkiller-phishing-service-proxies-real-login-pages-mfa/\n\nhttps://abnormal.ai/blog/starkiller-phishing-kit", "ocr_text": "", "has_image": false}
{"id": "t3_1rca654", "url": "https://reddit.com/r/phishing/comments/1rca654/united_healthcare_medicare_survey_lithuania/", "victim_title": "United Healthcare Medicare Survey - Lithuania Indonesia", "victim_body": "Recieved an email form \"United Healthcare\":\n\nCCUnitedHealthcareMedicareKit • \n\n40a.mayridhoputri@vidatra.sch.id\n\nI was specially selected to receive a brand new free Medicare kit from United Healthcare, IF I complete a survey.\n\nNot sure what led me to believe it was a scam. It could have been the Indonesia domain. Or it could have been that Google was asking if I needed the email translated from Lithuanian. Or possibly the large cold cream and lotion looking bottles in the \"kit\".\n\nTo be safe, I declined. ", "ocr_text": "", "has_image": false}
{"id": "t3_1rc0fl6", "url": "https://reddit.com/r/phishing/comments/1rc0fl6/how_do_we_remove_this_fake_site_its_top_result/", "victim_title": "How do we remove this fake site? It’s top result but it’s a fake copy of our real website", "victim_body": "Hey guys,\n\nI have a built a gaming tool and it’s doing well but if you google our site there is a fake copy of our exact login flow. This site is clearing a phishing kit used to copy exact site content and trick users. I’ve reported 10 times to google but nothing.\n\nI have added SEO to our site and linked a google crawlers text endpoint as well as a google key to our cname to try get our site back on top but it’s not working.\n\nIs there anything else we can do? ", "ocr_text": "", "has_image": false}
{"id": "t3_1rcd328", "url": "https://reddit.com/r/phishing/comments/1rcd328/is_this_apple_email_a_scam/", "victim_title": "Is this Apple email a scam?", "victim_body": "So my dad recently told me he kept getting emails from apple saying there was an unsuccessful attempt at changing the apple account password. The email was verified from google so it didn't look like a scam. It said it recommended I changed my password if this was not me, so I did (ofc through the settings app and not stupid email links). Just to be sure I also set a 2FA on his device and set mine as a backup.\n\nBut the same email is still being sent. The funny thing is Robert N. is not even his name, nor the name in his account, which leads me to believe this might be a scam, but google considers it a verified email address. Anyone had any similar experiences? Is this perhaps a bug or smth?\n\nhttps://preview.redd.it/2gzdb6l5s7lg1.png?width=2060&amp;format=png&amp;auto=webp&amp;s=824d5622c4c98fd0d2d2f0c58e5ea46013371f46\n\n", "ocr_text": "", "has_image": false}
{"id": "t3_1rccgji", "url": "https://reddit.com/r/phishing/comments/1rccgji/problem_with_gophish_message_sent_but_not_received/", "victim_title": "Problem with Gophish : message sent but not received.", "victim_body": "So, I want to test gophish with a mail address I got with a domain on ovh Cloud, I set up all the infos : \n\n\\-SMTP from : my mail address\n\n\\-Host : [ssl0.ovh.net](http://ssl0.ovh.net) (not really sure about this one)\n\n\\-Username : my mail address again\n\n  \nThen I try to send a test mail, it tells me that the mail is sent but I'm never receiving it (I tested both on gmail and outlook).\n\nI genuinely don't know what I'm missing. \n\n", "ocr_text": "", "has_image": false}
{"id": "t3_1rc3lk3", "url": "https://reddit.com/r/phishing/comments/1rc3lk3/can_phishing_come_from_a_discontinued_number_and/", "victim_title": "Can phishing come from a discontinued number and use that persons name ?", "victim_body": "Like can a call and text pretending to be the person from that old contact ? \n\nI cannot figure this out . \n\nFirst I got a phone call from Chicago number at 11pm  asking for my kid but making no sense but asking where they went to school also  . \n\nThen when I hung up I immediately got a text from a contact I never erased discontinued mom’s number (also Chicago)  pretending to be that person and mentioned another little kid . Didn’t give any info but weird with the two kids names . \n\nAnyone have this happen? ", "ocr_text": "", "has_image": false}
{"id": "t3_1rbuv5x", "url": "https://reddit.com/r/phishing/comments/1rbuv5x/anyone_receiving_these_email_after_panera_breach/", "victim_title": "Anyone receiving these email after Panera breach?", "victim_body": "I’ve received this email.. at first I was scared because i’ve never had this happened to me. I called my boyfriend to ask if this is real.  Is this something I should  be concerned about, and what should I do?", "ocr_text": "", "has_image": false}
{"id": "t3_1rbhntk", "url": "https://reddit.com/r/phishing/comments/1rbhntk/got_a_weird_email_and_i_wonder_what_it_could_do/", "victim_title": "Got a weird email and I wonder what it could do", "victim_body": "I got today from my email address a weird email with gibrish subject and the time of when it was sent. I verified that the sender faked the \"from\" field but I worry about this embedded base64 image. the image itself doesn't show in the email. I'm somewhat worried this might've been a payload of some kind...", "ocr_text": "", "has_image": false}
{"id": "t3_1rbfxr2", "url": "https://reddit.com/r/phishing/comments/1rbfxr2/outlookm365_email_looks_from_me_to_me_not_junk/", "victim_title": "Outlook/M365 email looks “from me to me” — “Not junk” + Microsoft user submissions report. Normal? Possible compromise?", "victim_body": "Hey everyone — I’m seeing something really strange and I’m confused. I received an email that *looks like it was sent from my email to my email*, but the subject starts with **“Not junk:”** and the body is basically a wall of **message headers / IDs** and links to Microsoft Defender settings (e.g., `security.microsoft.com/userSubmissionsReportMessage`). I don’t remember clicking “Not junk” or reporting anything.\n\nOne extra detail: I **recently subscribed to ChatGPT (OpenAI)** using the **same email address**, and the original sender shown in the report looks like an OpenAI noreply address — I’m not sure if this is related or just coincidence.\n\nIs this a normal Microsoft 365/Outlook “user submission / not junk report” notification, or should I be worried about account compromise (rules/forwarding), malware, or a leak? It feels sketchy that it looks self-sent. I’m clueless — if anyone has seen this before, what usually triggers it and what should I check?\n\n\n\n\n\n", "ocr_text": "Not junk:088c9c94-78d6-4cfe-223c-08de6a67cdfe|noreply@email.openai.com|(Updates to OpenAl’s Privacy Policy) |G summarize\n\nN NK © S Reply & Replyall © Forward ®D\n® To: ® NK Sun 2/22/2026 12:18 AM\n\nSubmitter: is)\n\nObjectid: 088c9c94-78d6-4cfe-223c-08de6a67cdfe\n\nSubmissionld: 9edf7e6a-28f1-46f8-cOb8-08de7 1d18462\n\nInternetMessageld:\n\nMessage content:\n\n# Questionable URLs detected in message: None Received: from DS4PPFD3D1418D5.NAMP221.PROD.OUTLOOK.COM (2603:10b6:f:fc00::dd2) by\nSA1P221MB1405.NAMP221.PROD.OUTLOOK.COM with HTTPS; Thu, 12 Feb 2026 18:52:02 +0000 Received: from\nDSOPR17CA0010.namprd17.prod.outlook.com (2603:10b6:8:191::26) by DS4PPFD3D1418D5.NAMP221.PROD.OUTLOOK.COM (2603:10b6:f:fc00::dd2) with\nMicrosoft SMTP Server (version=TLS1_2, cipher=TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384) id 15.20.9611.13; Thu, 12 Feb 2026 18:52:00 +0000\nReceived: from DS3PEPFO00099DD.namprd04.prod.outlook.com (2603:10b6:8:191:cafe::f7) by DSOPR17CA0010.outlook.office365.com (2603:10b6:8:191::26)\nwith Microsoft SMTP Server (version=TLS1_3, cipher=TLS_AES_256_GCM_SHA384) id 15.20.9611.11 via Frontend Transport; Thu, 12 Feb 2026 18:51:56\n+0000 Received: from 025.ptr1149.0penai.com (159.183.13.60) by DS3PEPFO00099DD.mail.protection.outlook.com (10.167.17.199) with Microsoft SMTP\nServer (version=TLS1_3, cipher=TLS_AES_256_GCM_SHA384) id 15.20.9611.8 via Frontend Transport; Thu, 12 Feb 2026 18:52:00 +0000 Received: by recvd-\n678ccb598b-n9xzh with SMTP id recvd-678ccb598b-n9xzh-1-698E214F-26 2026-02-12 18:51:59.545010221 +0000 UTC m=+4913143.895071180 Received:\nfrom MjAyMTY3MDY (unknown) by geopod-ismtpd-16 (SG) with HTTP id CrHTHh5nSSu3dCsVxXKV8w Thu, 12 Feb 2026 18:51:59.480 +0000 (UTC)\nContent-Type: application/ms-tnef; name=\"winmail.dat\" Content-Transfer-Encoding: binary From: OpenAl To: NK Subject: Updates to OpenAl’s Privacy\nPolicy Thread-Topic: Updates to OpenAl's Privacy Policy Thread-Index: AQHcnFCssNFNhwD+eE2r9ugAAfvYFw== Date: Thu, 12 Feb 2026 18:51:59 +0000\nMessage-ID: Content-Language: en-US X-MS-Exchange-Organization-AuthAs: Anonymous X-MS-Exchange-Organization-AuthSource:\nDS3PEPFO00099DD.namprd04.prod.outlook.com X-MS-Exchange-Organization-ComplianceLabelld: 3dbb5f39-dc76-4916-9db3-fa9191760a55 X-MS-Has-\nAttach: X-MS-Exchange-Organization-Network-Message-ld: 088c9c94-78d6-4cfe-223c-08de6a67cdfe X-MS-Exchange-Organization-SCL: 1 X-MS-TNEF-\nCorrelator: X-MS-Exchange-Organization-RecordReviewCfmType: 0 x-ms-publictraffictype: Email received-spf: Pass (protection.outlook.com: domain of\nem6623.email.openai.com designates 159.183.13.60 as permitted sender) receiver=protection.outlook.com; client-ip=159.183.13.60;\nhelo=025.ptr1149.0penai.com; pr=C MIME-Version: 1.0 If you want such reports to go to Microsoft directly, you can change the reported message\ndestinations from the settings at https://security.microsoft.com/userSubmissionsReportMessage\n\nIf you want such reports to go to Microsoft directly, you can change the reported message destinations from the settings here\n\nS Reply 7 Forward", "has_image": true}
{"id": "t3_1rbdih7", "url": "https://reddit.com/r/phishing/comments/1rbdih7/is_this_a_legit_email_or_a_well_crafted_phishing/", "victim_title": "Is this a legit email or a well crafted phishing attempt", "victim_body": "Just received this email but weird because my playstation account is tied to my passkey on my iphone. Encrypted with TLS but the sending email kinda seems odd to me. Is someone just using my email from a data breach and taking a wild shot with the password reset or what?", "ocr_text": "", "has_image": false}
{"id": "t3_1rb58vv", "url": "https://reddit.com/r/phishing/comments/1rb58vv/how_to_stop_prn_spam_emails_in_gmail_for/", "victim_title": "how to stop P*rn spam emails in gmail for chromebook", "victim_body": "i dont know why but for the past month ive been getting porn spam emails and Its hurting my mental health can someone help. 99% of the time it goes to spam or trash because I set up filters but im scared they have my private infor or something bad. am i in danger ?", "ocr_text": "", "has_image": false}
{"id": "t3_1ra7u4w", "url": "https://reddit.com/r/phishing/comments/1ra7u4w/fell_for_this_one_today_assumed_it_was_a_document/", "victim_title": "Fell for this one today - assumed it was a document from my lawyers. It wasn't.", "victim_body": "Email stated it was from docusign so I clicked it as that's how documents are usually sent to me. The email is actually from a company that I've bought products from in the past. ", "ocr_text": "[pDocuSign\n\nDocument Ready\nDocument #97542716022026\n\nDigitally Signed & Certified\n\nDOCUMENT DETAILS\n\nEnvelope ID: 7#3K\nCompleted: February 19, 2026\nFile Size: 2.4 MB (PDF)\n\nCertificate ID: 7F-3K-9L-2P-8D-4R-1A-6S\n\nThank you for choosing DocuSign.\n\nDo Not Share This Email\n\nThis email contains a secure link to\nDocuSign. Please do not share this email,", "has_image": true}
{"id": "t3_1ra85wb", "url": "https://reddit.com/r/phishing/comments/1ra85wb/got_one_of_those_sextortion_scams_because_of_the/", "victim_title": "Got one of those sextortion scams because of the UPenn leak", "victim_body": "I've never gotten a sextortion email before, so when I got it in my spam folder, I was genuinely panicking. The whole \"I installed malware on your phone to access your mic, camera, etc.\" and \"I recorded you frequently visiting explicit sites\" and \"you have 48 hours from opening this email to pay me $1600 worth of bitcoin to not share this with everyone you know.\" (That's more or less direct quotes.) I have Bitdefender on my phone always scanning my files and checking my accounts, I have 2FA on most of my accounts, and none of my personal info stated within the email, but I was still worried. \n\nAfter finding that this was a common scam with no real weight to it, I permanently trashed the email. But the only thing I noticed that I haven't seen from other posts is the scammer supposedly got my email from the recent UPenn data breach. I didn't go to UPenn, but I did go to Drexel, which I imagine shares a lot of info with each other since the 2 universities are so close and share a lot of buildings, equipment, etc. I'm still assuming that the email was just a scam that included the recent hack to give the scam more weight. Again, they didn't list any of my passwords, emails, or even any of the sites I supposedly visited, nor was my email spoofed, but I'm still a very anxious person, so was this still a nothing scam?", "ocr_text": "", "has_image": false}
{"id": "t3_1racatt", "url": "https://reddit.com/r/phishing/comments/1racatt/is_this_a_phishing_email/", "victim_title": "is this a phishing email?", "victim_body": "this is my first time posting on here ever but i need help. a few days ago i applied to kaiser for their pharmacy assistant role. this morning i got this email that asked me to complete a candidate snapshot and upload it to my profile, as well as a copy of my resume (which i already submitted via indeed). I just completed the candidate snapshot and was going to upload it when i double checked the email and saw that it literally says @invalidemail. so that led me to reread everything where i noticed some small errors like the double period and the random 9 in “des9gnated”. is this a scam? i know a lot of people say that scammers get ur info from indeed but how could they know i applied to this position? should i follow the instructions anyway? i would like to work there but im unsure if this is a scam or not. sorry if i sound silly. thank u!", "ocr_text": "", "has_image": false}
{"id": "t3_1r9rdnb", "url": "https://reddit.com/r/phishing/comments/1r9rdnb/phishing_college_edition/", "victim_title": "Phishing - college edition", "victim_body": "Clicked on it on accident and panic clicked off but I’m assuming it would’ve wanted me to “re enter bank information”. How lame. Also carrot.jp seems real legit for sure. But since I go to a community college I can’t imagine how many people have actually fell for it unfortunately :(", "ocr_text": "4:57 =~ al => Ger\n\n€ New Info\n© BM Technologies Disbursements Feb 16\nTo You aise\n\nYou don't often get email from gzm@carrot.ocn.ne.jp. Learn why\nthis is important\n\nDear student,\n\nWe noticed your refund account has been flagged as an\nunverified student enrolled, due to an error in our new\nsystem upgrade. We urge you to kindly re verify your\naccount below in order to prevent your refund or aid from\nbeing delayed.\n\nValidate your account: www.vibeaccount.com\n\nHave questions? Visit our FAQ page, or contact Customer\nService at 1-877-327-9515.\n\nThank you,\nThe Customer Success Team\n\n(c)2026 BM Technologies, Inc. a wholly owned subsidiary\nof BM Technologies All Rights Reserved.\n\n. -\nS ~ Reply S wW Tone j “5\niad\n\nWET Calendar Apps", "has_image": true}
{"id": "t3_1r9eo7y", "url": "https://reddit.com/r/phishing/comments/1r9eo7y/outlook_draft_scam_spam_flood/", "victim_title": "Outlook Draft Scam spam flood", "victim_body": "Today my outlook got hacked, and all the mails i was receiving were changed to the mail you can see above. So i changed my password and disconnected all devices + cleared my mailbox. It partially fixed my issue, but also made it worse. Now the scam became  a draft message created every 5 seconds and automatically transferred to my inbox, pinned and flagged. It is flooding my mailbox and i cant see my other mails. Deleting them doesn't change anything, and I've already changed my password, disconnected all accounts, and checked for rules, but the problem persists. Every hour I find myself with over 1000 of these drafts... Help me please, tried everything.", "ocr_text": "", "has_image": false}
{"id": "t3_1r9381b", "url": "https://reddit.com/r/phishing/comments/1r9381b/weird_lenovo_services_registration_email_with_csv/", "victim_title": "Weird Lenovo Services Registration email with CSV file?", "victim_body": "https://preview.redd.it/rgqzw6l4vgkg1.png?width=1474&amp;format=png&amp;auto=webp&amp;s=bc1ba002d20d50344af3baf7f02e8c98e00b9be0\n\nHere is the email I got. I do have a few Lenovo devices but I haven't registered to anything recently. The email came from some personal mail with a last name and @ lenovo .com, the file is CSV format. Its really weird...", "ocr_text": "", "has_image": false}
{"id": "t3_1r8bude", "url": "https://reddit.com/r/phishing/comments/1r8bude/venmo_buyer_scam_tries_to_get_to_sellers_to/", "victim_title": "Venmo buyer scam tries to get to sellers to provide advanced fee", "victim_body": "I saw this on Nextdoor.com. Venmo buyer scam tries to get to sellers to provide advanced fee. I'm not sure if all the details are clear, but I think clear enough to make out the scam. Sounds like the buyer sent a second fraudulent message...either from Venmo or a fake escrow party...that tried to get the seller to pay an up-front fee. ", "ocr_text": "Sellers Beware... was caught up this afternoon in a buyer scam. The buyer\nsent an interest and insisted that we use Venmo for the exchange. |\nimmediately received an email that said the amount was on hold and that |\nneeded to call a number immediately to resolve the hold. Ultimately, they\nhooked me in by saying the buyer would put up an additional $500 dollars to.\n‘help! me establish a limit that would let the buyer's payment get through and\nthen we would refund the $500 dollars. This led down a 3 hour path of them\ntrying to get me to send more and more money. Fortunately, | stopped it was\nable to get my credit card to refund the fraudulent payment. Please beware\nof eager buyers with a problem on Venmo.... believe me it was a scam!", "has_image": true}
{"id": "t3_1r8na64", "url": "https://reddit.com/r/phishing/comments/1r8na64/scanned_an_email_qr_code_via_my_work_email_on_my/", "victim_title": "Scanned an email QR code via my work email on my personal phone", "victim_body": "Hey everyone I scanned a QR code today at work that I shouldn’t have. It was an email to my work email telling me that I had a voicemail at my desk phone. We get these emails from time to time , but never with a QR code. I scanned the QR code with my personal phone, cause I’m an idiot, but then rethought it as the page loaded to a Microsoft log in. I quickly closed out and cleared my cache , cookies, and history on safari.  I did not input any log in information or anything, just scanned the QR.\n\nI contacted IT about it and they said my phone should be fine as long as I didn’t input anything. However , now on my personal Gmail on my phone I’ve gotten 2 phishing emails just today from iCloud and something else I can’t remember , I reported both. Do you think I’m fine and just being targeted since I scanned the QR or is something wrong with my phone now?", "ocr_text": "", "has_image": false}
{"id": "t3_1r7p3ql", "url": "https://reddit.com/r/phishing/comments/1r7p3ql/finally_got_one_of_these_in_my_junk_folder/", "victim_title": "Finally got one of these in my junk folder.", "victim_body": "Seeing as it’s been 336 hours since I got this, surely all that embarrassing footage got sent to everyone ai know, right? Is it too late to send the money?", "ocr_text": "", "has_image": false}
{"id": "t3_1r7l9b2", "url": "https://reddit.com/r/phishing/comments/1r7l9b2/someone_has_hacked_my_email_and_logging_into_all/", "victim_title": "Someone has hacked my email and logging into all my accounts :(", "victim_body": "Hi allllll, \n\nI hope this post is okay, unsure how to word it but just feeling insanely panicked. \n\nSo I am a ditz and have used the same password for a lot of different things (lesson learnt the hard way) \n\nI got an email that is the typical, I’ve been watching you and am going to leak videos / photos of you etc but this time it had my password in the email. \n\nThey are deleting all emails I’m getting, they’ve managed to keep a flagged email which is their original email to me at the top of my inbox. \n\nThey’ve locked me out of my Facebook. I’ve changed all these passwords now though and I’ve created a new email to link everything too. \n\nThey added a new folder on my emails saying “FINAL WARNING” \n\nIs there anything else I can do? \n\nI’m absolutely crapping myself and feel so violated. I don’t really know what to do from here. \n\nAny advice on how to stop this or what I can do to get my email back please let me know! \n\nI’ve also requested for all devices that are logged into my email to be kicked off and I’ve changed my password so I hope that helps somewhat. \n\nThank you in advance 🙏 ", "ocr_text": "", "has_image": false}
{"id": "t3_1r7qmbd", "url": "https://reddit.com/r/phishing/comments/1r7qmbd/watch_out_for_phishing_emails/", "victim_title": "Watch out for phishing emails", "victim_body": "I’ve been getting a lot of emails about free stuff like YOU WON A FREE MOTORCYCLE!!! And after that it always says “FOR LIFE OUT HERE” if this happens to you report it and don’t click any links. Also check their email address, if it’s not official it %99.999 of the time a scam. Be careful out there!", "ocr_text": "", "has_image": false}
{"id": "t3_1r7ppwx", "url": "https://reddit.com/r/phishing/comments/1r7ppwx/clicked_link_and_then_some/", "victim_title": "Clicked link and then some", "victim_body": "Sooooo i got an email from what seemed like a legit email address with text that initially seemed legit enough for me. It was for a job interview and i was/am very desperate so i acted on impulse and necessity.\n\nIt included a Microsoft teams link and i clicked it, downloaded teams through it and then logged into my old college email and then an email that only is connected to my xbox account. Nothing else. \n\nI had looked up the company and it exists, its NewLimit and the email address was from a *companyname*(at)usa(dot)com, even the name provided in it (Cathy O’Hare) was backed up online so it didn’t set off any alarm bells for me initially till i reread the email (after it all) and saw a typo.\n\nHow screwed am I? I’m on iphone, current ios. Chilling in lockdown mode rn.\n\nEDIT: What I've done since:\n\nSo I've been checking to see if any new VPNS, apps, calendar items, links or anything have popped up and there's been nothing yet, and I initially downloaded this malware around like noon yesterday.\n\nI've changed my passwords through another device for everything of importance (banks, work accounts, social media, etc.) I've also deleted the apps for any of those things and don't plan to log back in or keep any of the important passwords in my icloud keychain.\n\nWhat are steps I could do to rectify this and atleast get this malware off of my phone?", "ocr_text": "", "has_image": false}
{"id": "t3_1r7p75o", "url": "https://reddit.com/r/phishing/comments/1r7p75o/anyone_had_any_runins_with_burdavcom/", "victim_title": "Anyone had any run-ins with @burdav.com?", "victim_body": "So my Amazon account got hacked. One of the things was a $100GC being sent to [parisancle ](mailto:parisancle@burdav.com)at the domain in the title and when i search that domain if sends me to google and asks me to sign-in, like a phishing scam. Anyone else had any experience like this", "ocr_text": "", "has_image": false}
{"id": "t3_1r7lggh", "url": "https://reddit.com/r/phishing/comments/1r7lggh/agileengine_job_opportunity_scam/", "victim_title": "AgileEngine job opportunity scam ?", "victim_body": "I got an email from u/agileengineuq.us about job opportunity, I thought it's a follow up from a guy that called me day before about a job and said company will contact me on email and next day I got this email you can see on screenshot Ianswered the email and next day I got another email from same person this time she had photo and different domain u/jobsagileengine.com explaining the job and 2 days later she sent another email to complete application through their LaunchPod.\n\nIs this a scam, I tried to find something about this cause it's kinda weird but I only saw one post about this 2y ago. \n\nhttps://preview.redd.it/dseteuskv4kg1.png?width=936&amp;format=png&amp;auto=webp&amp;s=6cfc77429a6bfa51946669d5c15e6e41c3031aca\n\n", "ocr_text": "", "has_image": false}
{"id": "t3_1r6qzch", "url": "https://reddit.com/r/phishing/comments/1r6qzch/massive_phishing_emails_from_calendly/", "victim_title": "Massive phishing emails from Calendly", "victim_body": "Hey everyone,\n\nOver the last week I’ve been getting absolutely flooded with phishing attempts that come in as Calendly event invitations, like 300–400 per day.\n\nThe worst part is that I actually use Calendly for real work, so these fake invites clutter my calendar, push real meetings out of view and waste a ton of time because I have to verify every invite manually\n\nIt’s basically turning my calendar into a spam inbox.\n\nHas anyone else been seeing this recently?\n\nIf yes, did you find a good way to block it without breaking legit Calendly invites?", "ocr_text": "", "has_image": false}
{"id": "t3_1r6lj4r", "url": "https://reddit.com/r/phishing/comments/1r6lj4r/intellectual_property_phishing_scam/", "victim_title": "Intellectual Property Phishing Scam", "victim_body": "Hi Guys,\n\nJust got this email and looked quite legitimate half asleep I tried previewing the attachment which came up with a black screen saying not compatible with this device please use a computer. I then decided to google the sender noreply(at)appsheet.com I believe this is how they get through Googles servers. \n\nHas anyone had one of these before? It’s odd as I live in Australia.\n\nAny advice would be appreciated. Usually I don’t pay these sort of emails attention. What do you think is in the PDF that they want or they tried to obtain?", "ocr_text": "", "has_image": false}
{"id": "t3_1r5bq0z", "url": "https://reddit.com/r/phishing/comments/1r5bq0z/receiving_daily_10_spam_mail/", "victim_title": "Receiving daily 10+ spam mail", "victim_body": "been receiving this kind of e-mails for the past months. Driving me crazy. How do I get rid of it? Clicking on it sends me to idm2.info, selecteasy.info, etc. ", "ocr_text": "", "has_image": false}
{"id": "t3_1r5ez5p", "url": "https://reddit.com/r/phishing/comments/1r5ez5p/iphone_security_check_popup/", "victim_title": "iPhone “Security Check” Pop-up", "victim_body": "Hello! I was checking my Steps third-party app while on the threadmill when I saw a \"Security Check\" pop-up that looked like it's from the iPhone. I stupidly tapped \"Not Now\" thinking I would deal with it later,  but then I was directed to this site on Safari.\n\nI know iPhone doesn't get viruses. And I know because I didn't tap anything on this website that I'm probably safe. But at this point, as the receiver, I can't help but panic a little because of the language used.\n\nSo I guess any assurance from other people that nothing's wrong would be helpful. Thank you.", "ocr_text": "@S 42 viruses were found\n\nYour iPhone was hacked after visiting website and\n42 viruses were found! If this problem is not\nresolved within two minutes, the viruses will delete\nall your contacts and photos, and the SIM card will\nbe damaged!\n\n1 minute 18 seconds\n\nHow to remove all viruses:\nStep 1: Click the “Remove all Viruses” button below;\nStep 2: You will be redirected to the AppStore;\n\nStep 3: Install the verified security app, open it, and\nstart the cleanup.\n\nRemove all Viruses\n\n| = memorysweepapp.com 1G\n\n< > (4 an)", "has_image": true}
{"id": "t3_1r4dwhf", "url": "https://reddit.com/r/phishing/comments/1r4dwhf/why_am_i_getting_this_email/", "victim_title": "Why am I getting this email?", "victim_body": "I am getting this email from suspicious emails addresses. One from the philipines (.ph) and one from a payment site.\n\n  \nI didnt use my email to sign up anything past months. I have also never signed up for anything related to the US government.\n\n  \nPlease let me know if you are familiar with this phishing scam or is it legit.\n\n  \nThank you!", "ocr_text": "", "has_image": false}
{"id": "t3_1r4myhx", "url": "https://reddit.com/r/phishing/comments/1r4myhx/suspicious_email_been_getting_these_for_a_few_year/", "victim_title": "Suspicious email been getting these for a few year", "victim_body": "For a couple of years I keep getting email form this person Abigail Plungis wanting me to click on a link. Im not sure whats going on as according to a link scanner website, some of the links are dead. Ill enclose the latest email. Its just real creepy the persistance of this person sending me these wierd emails.\n\n    On Tuesday, February 10, 2026 10:51 AM, Abigail Plungis wrote:\n    \n    Meant to send both of them way sooner: two pics https: // tjjyqc. dftehsue. com:8443/  \n    \n    \n    Sent from my iPhone", "ocr_text": "", "has_image": false}
